/**
 *   ===========================================================================================
 *   ||----------------------- 请求接口文档 ----------------------------------------------------||
 *   ===========================================================================================
     DESC: 登录接口：
            ☆接口：/user/login
            ☆请求方式：Post
            ☆入参：
                字段：                 是否必传：           描述
                1、account:            必传                登录账号
                2、password：          非必传               登录密码，md5加密，不传时需要用验证码验证登录
                3、deviceId:           必传                设备唯一识别码，md5加密
            ☆出参：
                1、
                2、

 private int id;
 private String account;
 private String name;
 private String password;
 private String date;
 private String sex;
 private String avatarUrl;
 private String status;//登录状态
 private String accessToken;
     --------------------------------------------------------------------------------------------
     DESC: 查找用户是否穿在接口
            ☆接口：/user/findUser
            ☆请求方式：Get
            ☆入参：
                字段：                 是否必传：           描述
                1、account：           必传                 账号
            ☆出参
     --------------------------------------------------------------------------------------------

     DESC: 创建用户接口
            ☆接口：/user/createNewUser
            ☆请求方式：Post
            ☆入参：
                字段：                 是否必传：           描述
                1、account:            必传                要创建的账号
                2、password:           必传：              用户密码
                3、date:               必传                创建日期
            ☆出参：
     --------------------------------------------------------------------------------------------











 * */